import * as React from "react";
import Svg, { Mask, Path } from "react-native-svg";

const SvgComponent = (props) => (
  <Svg
    xmlns="http://www.w3.org/2000/svg"
    width={16}
    height={16}
    viewBox="1 1 16 16"
    {...props} // Để props có thể được truyền từ bên ngoài
  >
    <Mask id="a" fill="#fff">
      <Path d="M6.889 15.681A3.472 3.472 0 0 0 9.625 17a3.472 3.472 0 0 0 2.736-1.319 20.373 20.373 0 0 1-5.472 0Z" />
    </Mask>
    <Path
      fill={props.fill || "#111"} // Sử dụng màu từ props, hoặc mặc định là "#111"
      d="M6.889 15.681A3.472 3.472 0 0 0 9.625 17a3.472 3.472 0 0 0 2.736-1.319 20.373 20.373 0 0 1-5.472 0Z"
    />
    <Path
      fill={props.fill || "#111"} // Sử dụng màu từ props
      d="m6.889 15.681 4.476-33.031-81.567-11.054L-19.31 36.29 6.89 15.681Zm5.472 0 26.199 20.61 50.893-64.695L7.885-17.35 12.36 15.68Zm-31.67 20.61A36.805 36.805 0 0 0 9.624 50.332v-66.666c9.376 0 17.941 4.386 23.463 11.405L-19.31 36.29ZM9.624 50.332A36.805 36.805 0 0 0 38.56 36.291L-13.837-4.93C-8.316-11.946.249-16.333 9.625-16.333v66.667ZM7.885-17.35a12.96 12.96 0 0 1 3.48 0L2.413 48.713a53.7 53.7 0 0 0 14.425 0L7.885-17.35Z"
      mask="url(#a)"
    />
    <Path
      fill={props.fill || "#111"} // Sử dụng màu từ props
      d="M14.687 7.25v.528c0 .634.18 1.253.52 1.78l.83 1.293c.759 1.18.18 2.784-1.14 3.158a19.345 19.345 0 0 1-10.544 0c-1.32-.374-1.899-1.978-1.14-3.158l.83-1.292c.34-.528.52-1.147.52-1.78V7.25C4.563 4.35 6.83 2 9.625 2c2.796 0 5.062 2.35 5.062 5.25Z"
    />
  </Svg>
);

export default SvgComponent;
